# 03. Perform Data Preparation in Vantage using Python

this script shows:

1. Load libraries and set up connection
2. Read raw data from Vantage
3. Perform feature engineering
4. Create the Analytical Dataset (ADS)
5. Create the train/test dataset

## 03.01. Load libraries and set up connection

In [12]:
# Load standard libraries
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import getpass

In [14]:
# import statements
from teradataml.dataframe.dataframe import DataFrame
from teradataml.dataframe.copy_to import copy_to_sql
from teradataml.context.context import create_context, remove_context
from teradataml.options.display import display
#from teradataml.analytics.Sessionize import Sessionize

In [ ]:
host = 'tddb.env-d-52.vantage.demo.intellicloud.teradata.com'
user = input("Username:")
password = getpass.getpass("Password:")

eng = create_context(host = host, username = user, password = password) # connects using goSQL driver
conn = eng.connect()
print(eng)
print(conn)

Username: user1
Password: ·····

Engine(teradatasql://user1:***@tddb.env-d-52.vantage.demo.intellicloud.teradata.com)
<sqlalchemy.engine.base.Connection object at 0x1a191f07f0>

## 03.02 Read the raw dataset

In [ ]:
df_all_data = DataFrame('titanic_all_data_0')

## 03.03 Feature Engineering

#### 03.03.01. Age

Let's explore the number of NAN in the Age column

### Age Fixing

#### Missing data

In [ ]:
df_age = df_all_data.select(["age"])

In [ ]:
df_age = df_age.assign(n = 1)

In [ ]:
df_age = df_age.groupby(["age"]).agg('count')

In [ ]:
df_age.sort('count_n', ascending=False)

    age count_n
0   NaN     263
1  24.0      47
2  22.0      42
3  21.0      41
4  30.0      40
5  18.0      39
6  25.0      34
7  28.0      32
8  36.0      31
9  29.0      30

#### - The Age column has many NULLS, how can we deal with this?
#### - Investigate using Average

In [ ]:
df_all_data.select(["age"]).agg('mean')

    mean_age
0  29.884262

#### -can we make it more realistic?

In [ ]:
df_age = df_all_data.select(["gender","age"]).dropna()

In [ ]:
df_age.groupby(['gender']).agg('mean')

  gender   mean_age
0      0  28.687088
1      1  30.592348

#### -Engineer a feature called "ptitle" to make the data interpolation more accurate.

In [ ]:
# Create a dataframe from SQL Query
qry = "SELECT a.*,CASE \
            WHEN pname like '%Mr.%' THEN 'Mr'\
            WHEN pname like '%Mrs.%' THEN 'Mrs'\
            WHEN pname like '%Miss.%' THEN 'Miss'\
            WHEN pname like '%Capt.%' THEN 'Capt'\
            WHEN pname like '%Col.%' THEN 'Col'\
            WHEN pname like '%Countess.%' THEN 'Countess'\
            WHEN pname like '%Don.%' THEN 'Don'\
            WHEN pname like '%Dr.%' THEN 'Dr'\
            WHEN pname like '%Lady.%' THEN 'Lady'\
            WHEN pname like '%Major.%' THEN 'Major'\
            WHEN pname like '%Master.%' THEN 'Master'\
            WHEN pname like '%Mlle.%' THEN 'Mlle'\
            WHEN pname like '%Mme.%' THEN 'Mme'\
            WHEN pname like '%Ms.%' THEN 'Ms'\
            WHEN pname like '%Rev.%' THEN 'Rev'\
            WHEN pname like '%Sir.%' THEN 'Sir'\
            ELSE 'Other'\
            END AS ptitle\
            FROM titanic_all_data_0 a;"

# Create a TeradataML DataFrame "
df_titanic_all_data_1 = DataFrame.from_query(qry)

In [ ]:
df_titanic_age_lookup = df_titanic_all_data_1.select(['ptitle', 'age']).dropna()

In [ ]:
df_titanic_age_lookup = df_titanic_age_lookup.groupby(['ptitle']).agg('mean').sort('mean_age', ascending=False)

In [ ]:
df_titanic_age_lookup.head()

   ptitle   mean_age
0     Mrs  36.994118
1      Dr  43.571429
2    Capt  70.000000
3  Master   5.482642
4     Mme  24.000000
5     Sir  49.000000
6      Mr  32.265976
7      Ms  28.000000
8     Don  40.000000
9   Other  38.500000

In [ ]:
df_titanic_age_lookup = df_titanic_age_lookup.assign(age_view_title = df_titanic_age_lookup['ptitle'])

In [ ]:
df_titanic_age_lookup

   ptitle   mean_age age_view_title
0   Other  38.500000          Other
1   Major  48.500000          Major
2      Ms  28.000000             Ms
3     Don  40.000000            Don
4      Dr  43.571429             Dr
5  Master   5.482642         Master
6    Capt  70.000000           Capt
7     Mme  24.000000            Mme
8      Mr  32.265976             Mr
9     Sir  49.000000            Sir

In [ ]:
df_titanic_age_lookup = df_titanic_age_lookup.select(['age_view_title', 'mean_age'])

In [ ]:
copy_to_sql(df = df_titanic_age_lookup, table_name = "titanic_age_lookup", if_exists = "replace")

#### ---------------------------------------------------------------------------------------------------------
#### --Run some SQL statements to Update the orginal data with this new imputed data
#### ---------------------------------------------------------------------------------------------------------

In [ ]:
copy_to_sql(df = df_titanic_all_data_1, table_name = "titanic_all_data_1", if_exists = "replace")

In [ ]:
copy_to_sql(df = df_titanic_age_lookup, table_name = "titanic_age_lookup", if_exists = "replace")

In [ ]:
# Create a dataframe from SQL Query
qry = "UPDATE titanic_all_data_1 \
        FROM titanic_age_lookup \
        SET age = mean_age \
        WHERE ptitle = age_view_title \
        AND age IS NULL;"

# Create a TeradataML DataFrame "
eng.execute(qry)

#### -- Check age

In [ ]:
# Create a dataframe from SQL Query
qry = "SELECT a.ptitle , a.age \
       FROM titanic_all_data_1 a;"

# Create a TeradataML DataFrame "
result2 = DataFrame.from_query(qry)

In [ ]:
result2.groupby(["ptitle"]).agg('mean').sort('mean_age', ascending=False)

  ptitle   mean_age
0   Capt  70.000000
1    Col  54.000000
2    Sir  49.000000
3  Major  48.500000
4   Lady  48.000000
5     Dr  43.571429
6    Rev  41.250000
7    Don  40.000000
8  Other  38.500000
9    Mrs  36.994118

##### --------------------------------------------------------------------------------------------------------
##### -- Passenger class feature (Dummy Variable encoding)
##### --------------------------------------------------------------------------------------------------------

In [ ]:
df_titanic_all_data_2 = DataFrame.from_table("titanic_all_data_1")

In [ ]:
df_titanic_all_data_2.columns

['passengerid',
 'pclass',
 'pname',
 'gender',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked',
 'survived',
 'set_type',
 'ptitle']

In [ ]:
df_titanic_all_data_2 = df_titanic_all_data_2.to_pandas(index_column = 'passengerid')

In [ ]:
df_titanic_all_data_2.columns

Index(['pclass', 'pname', 'gender', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived', 'set_type', 'ptitle'],
      dtype='object')

In [ ]:
# in order to add passengerid as a column, not an index
df_titanic_all_data_2.reset_index(level=0, inplace=True)

In [ ]:
df_titanic_all_data_2.columns

Index(['passengerid', 'pclass', 'pname', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'survived', 'set_type',
       'ptitle'],
      dtype='object')

In [ ]:
df_titanic_all_data_2.head()

,passengerid,pclass,pname,gender,age,sibsp,parch,ticket,fare,cabin,embarked,survived,set_type,ptitle
0,282,3,Olsson Mr. Nils Johan Goransson,1,28.000000,0,0,347464,7.8542,None,S,0,train,Mr
1,648,1,Simonius-Blumer Col. Oberst Alfons,1,56.000000,0,0,13213,35.5000,A26,C,1,train,Col
2,585,3,Paulner Mr. Uscher,1,32.265976,0,0,3411,8.7125,None,C,0,train,Mr
3,949,3,Abelseth Mr. Olaus Jorgensen,1,25.000000,0,0,348122,7.6500,F G63,S,-1,test,Mr
4,476,1,Clifford Mr. George Quincy,1,32.265976,0,0,110465,52.0000,A14,S,0,train,Mr

In [ ]:
df_titanic_all_data_2.dtypes

passengerid      int64
pclass           int64
pname           object
gender           int64
age            float64
sibsp            int64
parch            int64
ticket          object
fare           float64
cabin           object
embarked        object
survived         int64
set_type        object
ptitle          object
dtype: object

In [ ]:
type(df_titanic_all_data_2)

pandas.core.frame.DataFrame

In [ ]:
type(df_titanic_all_data_2.pname[0])

str

In [ ]:
h=df_titanic_all_data_2.head()
h.head()

,passengerid,pclass,pname,gender,age,sibsp,parch,ticket,fare,cabin,embarked,survived,set_type,ptitle,temp
0,282,3,Olsson Mr. Nils Johan Goransson,1,28.000000,0,0,347464,7.8542,None,S,0,train,Mr,Olsson Mr. Nils Johan Goransson
1,648,1,Simonius-Blumer Col. Oberst Alfons,1,56.000000,0,0,13213,35.5000,A26,C,1,train,Col,Simonius-Blumer Col. Oberst Alfons
2,585,3,Paulner Mr. Uscher,1,32.265976,0,0,3411,8.7125,None,C,0,train,Mr,Paulner Mr. Uscher
3,949,3,Abelseth Mr. Olaus Jorgensen,1,25.000000,0,0,348122,7.6500,F G63,S,-1,test,Mr,Abelseth Mr. Olaus Jorgensen
4,476,1,Clifford Mr. George Quincy,1,32.265976,0,0,110465,52.0000,A14,S,0,train,Mr,Clifford Mr. George Quincy

In [ ]:
type(temp)

numpy.ndarray

In [ ]:
df_titanic_all_data_2["temp"] = temp

In [ ]:
df_titanic_all_data_2.dtypes

passengerid      int64
pclass           int64
pname           object
gender           int64
age            float64
sibsp            int64
parch            int64
ticket          object
fare           float64
cabin           object
embarked        object
survived         int64
set_type        object
ptitle          object
temp            object
dtype: object

In [ ]:
df_titanic_all_data_2["pclass_1"] = df_titanic_all_data_2.pclass.apply(lambda x: 1 if x==1 else 0)

In [ ]:
df_titanic_all_data_2["pclass_2"] = df_titanic_all_data_2.pclass.apply(lambda x: 1 if x==2 else 0)

#--------------------------------------------------------------------------------------------------------
#-- Family size
#--------------------------------------------------------------------------------------------------------
#/* 
#-   sibsp	# of siblings / spouses aboard the Titanic	
#-   parch	# of parents / children aboard the Titanic
#*/

In [ ]:
df_titanic_all_data_2["family_size"] = df_titanic_all_data_2["sibsp"] + df_titanic_all_data_2["sibsp"]

In [ ]:
df_titanic_all_data_2["family_single"] = df_titanic_all_data_2.family_size.apply(lambda x: 1 if x==1 else 0)

In [ ]:
df_titanic_all_data_2["family_small"] = df_titanic_all_data_2.family_size.apply(lambda x: 1 if x>1 & x<5  else 0)

In [ ]:
df_titanic_all_data_2["family_large"] = df_titanic_all_data_2.family_size.apply(lambda x: 1 if x>=5 else 0)

 #--------------------------------------------------------------------------------------------------------
 #-- Fare feature
 #--------------------------------------------------------------------------------------------------------

In [ ]:
avg_fare_value = df_titanic_all_data_2.fare.mean()

#-- update missing values with the mean fare

In [ ]:
df_titanic_all_data_2["fare_fixed"] = df_titanic_all_data_2.fare.apply(lambda x:  avg_fare_value if x == "" else x)


#--------------------------------------------------------------------------------------------------------
#-- Embarkation feature
#--------------------------------------------------------------------------------------------------------
#-- update missing values with the mode

In [ ]:
mode_embarkation = df_titanic_all_data_2.embarked.mode()[0]

In [ ]:
mode_embarkation

'S'

In [ ]:
df_titanic_all_data_2["embarked"] = df_titanic_all_data_2["embarked"].apply(lambda x: str(mode_embarkation) if x == "" else str(x))[0]

#-------------------------------------------------------------------------------------------------------
#-- Cabin feature
#--------------------------------------------------------------------------------------------------------

In [ ]:
df_titanic_all_data_2["cabin_level"] = df_titanic_all_data_2.cabin.apply(lambda x: "XXX" if x is None else x[0][:1]).astype('str')

In [ ]:
df_titanic_all_data_2["cabin_count"] = df_titanic_all_data_2.cabin.apply(lambda x: 1 if x is None else len(x)).astype('str')

#--------------------------------------------------------------------------------------------------------
#-- reduce dataset, pick certain features ready for prediction
#--------------------------------------------------------------------------------------------------------

In [ ]:
df_titanic_all_data_2.columns

Index(['passengerid', 'pclass', 'pname', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'survived', 'set_type', 'ptitle',
       'temp', 'pclass_1', 'pclass_2', 'family_size', 'family_single',
       'family_small', 'family_large', 'fare_fixed', 'cabin_level',
       'cabin_count'],
      dtype='object')

In [ ]:
df_titanic_all_data_final = df_titanic_all_data_2[["passengerid",
                                      "fare_fixed",
                                      "embarked",
                                      "age",
                                      "gender",
                                      "ptitle",
                                      "pclass_1",
                                      "pclass_2",
                                      "family_size",
                                      "cabin_level",
                                      "cabin_count",
                                      "survived",
                                      "set_type"]]

In [ ]:
df_titanic_all_data_final.head()

,passengerid,fare_fixed,embarked,age,gender,ptitle,pclass_1,pclass_2,family_size,cabin_level,cabin_count,survived,set_type
0,282,7.8542,S,28.000000,1,Mr,0,0,0,XXX,1,0,train
1,648,35.5000,S,56.000000,1,Col,1,0,0,A,3,1,train
2,585,8.7125,S,32.265976,1,Mr,0,0,0,XXX,1,0,train
3,949,7.6500,S,25.000000,1,Mr,0,0,0,F,5,-1,test
4,476,52.0000,S,32.265976,1,Mr,1,0,0,A,3,0,train

In [ ]:
copy_to_sql(df = df_titanic_all_data_final, table_name = "titanic_all_data_final", if_exists = "replace")

#--------------------------------------------------------------------------------------------------------
#-- Split to Train/Test
#--------------------------------------------------------------------------------------------------------

In [ ]:
df_titanic_all_data_final = df_titanic_all_data_final[df_titanic_all_data_final['set_type']=='train']

In [ ]:
df_titanic_all_data_final.head()

,passengerid,fare_fixed,embarked,age,gender,ptitle,pclass_1,pclass_2,family_size,cabin_level,cabin_count,survived,set_type
0,282,7.8542,S,28.000000,1,Mr,0,0,0,XXX,1,0,train
1,648,35.5000,S,56.000000,1,Col,1,0,0,A,3,1,train
2,585,8.7125,S,32.265976,1,Mr,0,0,0,XXX,1,0,train
4,476,52.0000,S,32.265976,1,Mr,1,0,0,A,3,0,train
9,367,75.2500,S,60.000000,0,Mrs,1,0,2,D,3,1,train

In [ ]:
# Check dimensions
df_titanic_all_data_final.shape

(890, 13)

In [ ]:
for c in df_titanic_all_data_final.columns:
    if df_titanic_all_data_final[c].dtype == object:
        print('convert ', df_titanic_all_data_final[c].name, ' to string')
        df_titanic_all_data_final[c] = df_titanic_all_data_final[c].astype('str')

convert  embarked  to string
convert  ptitle  to string
convert  cabin_level  to string
convert  cabin_count  to string
convert  set_type  to string

#--------------------------------------------------------------------------------------------------------
#-- Split the TRAINING data into a test/train set so we can build and test a model
#--------------------------------------------------------------------------------------------------------
#-- Selecting TRAINING Data using a 80/20 split

In [ ]:
df_titanic_all_data_final.dtypes

passengerid      int64
fare_fixed     float64
embarked        object
age            float64
gender           int64
ptitle          object
pclass_1         int64
pclass_2         int64
family_size      int64
cabin_level     object
cabin_count     object
survived         int64
set_type        object
dtype: object

In [ ]:
df_titanic_train = df_titanic_all_data_final.sample(frac=0.8,random_state=200)
df_titanic_test =  df_titanic_all_data_final.drop(df_titanic_train.index)

In [ ]:
df_titanic_train.head()

,passengerid,fare_fixed,embarked,age,gender,ptitle,pclass_1,pclass_2,family_size,cabin_level,cabin_count,survived,set_type
959,5,8.0500,S,35.0,1,Mr,0,0,0,XXX,1,0,train
770,521,93.5000,S,30.0,0,Miss,1,0,0,B,3,1,train
1220,300,247.5208,S,50.0,0,Mrs,1,0,0,B,7,1,train
740,814,31.2750,S,6.0,0,Miss,0,0,8,XXX,1,0,train
1151,770,8.3625,S,32.0,1,Mr,0,0,0,XXX,1,0,train

In [ ]:
# Store the results
copy_to_sql(df = df_titanic_train, table_name = "titanic_train_temp", if_exists = "replace")
copy_to_sql(df = df_titanic_test, table_name = "titanic_test_temp", if_exists = "replace")

#------------------------------------
#- Forcing to cast the features 
#-----------------------------------

In [ ]:
qry = "DROP TABLE titanic_train_final;"

# Execute Query
eng.execute(qry)

In [ ]:
qry = "CREATE TABLE titanic_train_final \
  AS( \
      SELECT  \
            CAST(passengerid AS int) as passengerid, \
            CAST(fare_fixed AS numeric) as fare_fixed, \
            CAST(embarked AS varchar(11)) as embarked, \
            CAST(age AS numeric) as age, \
            CAST(gender AS int) as gender, \
            CAST(ptitle AS varchar(16)) as ptitle, \
            CAST(pclass_1 AS int) as pclass_1, \
            CAST(pclass_2 AS int) as pclass_2, \
            CAST(family_size AS int) as family_size, \
            CAST(cabin_level AS varchar(13)) as cabin_level, \
            CAST(cabin_count AS int) as cabin_count, \
            CAST(survived AS int) as survived, \
            CAST(set_type AS varchar(16)) as set_type \
      FROM  titanic_train_temp) WITH DATA;" 

# Execute Query
eng.execute(qry)

In [ ]:
qry = "DROP TABLE titanic_test_final;"

# Execute Query
eng.execute(qry)

In [ ]:
qry = "CREATE TABLE titanic_test_final \
  AS( \
      SELECT  \
            CAST(passengerid AS int) as passengerid, \
            CAST(fare_fixed AS numeric) as fare_fixed, \
            CAST(embarked AS varchar(11)) as embarked, \
            CAST(age AS numeric) as age, \
            CAST(gender AS int) as gender, \
            CAST(ptitle AS varchar(16)) as ptitle, \
            CAST(pclass_1 AS int) as pclass_1, \
            CAST(pclass_2 AS int) as pclass_2, \
            CAST(family_size AS int) as family_size, \
            CAST(cabin_level AS varchar(13)) as cabin_level, \
            CAST(cabin_count AS int) as cabin_count, \
            CAST(survived AS int) as survived, \
            CAST(set_type AS varchar(16)) as set_type \
      FROM  titanic_test_temp) WITH DATA;" 

# Execute Query
eng.execute(qry)

In [ ]:
remove_context()

True